
Процедура СоздатьЭлементы(Параметры)
КонецПроцедуры

Процедура СоздатьДокументы(ВидДокумента, КоличествоДокументов)
КонецПроцедуры

// Имеет ли пользователь Административные полномочия
// 
// Возвращаемое значение:
//   Булево   - Является Да/Нет
//
Функция ЭтоАдминистратор() Экспорт
	Возврат Истина;
КонецФункции // ЭтоАдминистратор()

// Вернуть какой-то список
//
//# Параметры:
//#  ТипДанных  - Тип - Тип данных для обработки
//                 <продолжение описания параметра>
//#  ПостОбработка - Булево - Описание
//
//# Возвращаемое значение:
//#   Массив   - Записи
//#   Неопределено  - Записи
//#   Соответствие - Данные в ином виде
//
//#TestMethod: none
&НаСервере
Функция ПолучитьСписокОбъектовИгнорировать(ТипДанных, ПостОбработка = Истина) Экспорт // текст
	
КонецФункции // ПолучитьСписок()

// Вернуть какой-то список
//
//# Параметры:
//#  ТипДанных  - Тип - Тип данных для обработки
//                 <продолжение описания параметра>
//#  ПостОбработка - Булево - Описание
//
//# Возвращаемое значение:
//#   Массив   - Записи
//#   Неопределено  - Записи
//#   Соответствие - Данные в ином виде
//
//#TestMethod: 
&НаСервере
Функция ПолучитьСписокОбъектов(ТипДанных, ПостОбработка = Истина) Экспорт // текст
	
КонецФункции // ПолучитьСписок()

// Количество элементов в справочнике
//
//# Параметры:
//#  ВидСправочника  - Строка - ВидСправочника
//                 <продолжение описания параметра>
//# Возвращаемое значение:
//#   Число   - Количество элементов в справочнике
//
//#TestMethod: Тест_Должен_Вернуть_КоличествоЭлементов
&НаКлиенте
Функция КоличествоЭлементов(ВидСправочника) Экспорт
	Возврат 100;
КонецФункции // КоличествоКонтрагентов()

// Преобразование контрагента
//
//# Параметры:
//#  КонтрагентИсточник  - Справочник.Контрагенты - Контрагент которого необходимо преобразовать
//                 <продолжение описания параметра>
//#  КонтрагентПриемник  - Справочник.Контрагенты - Контрагент в которого необходимо преобразовать
//                 <продолжение описания параметра>
//#  ВТранзакции - Булево - Выполнять в транзации
//
//#TestMethod: Тест_Должен_ПреобразоватьКонтрагента
Процедура ПреобразоватьКонтрагента(КонтрагентИсточник, КонтрагентПриемник, ВТранзакции) Экспорт
	
КонецПроцедуры