
СписокТестов.Добавить("Тест_Должен_Вернуть_ЭтоАдминистратор");
СписокТестов.Добавить("Тест_Должен_Вернуть_ПолучитьСписокОбъектов");

Процедура Тест_Должен_Вернуть_ЭтоАдминистратор() Экспорт
	Сообщить("Тест пустышка!");
	// Результат = ОбъектТестирования.ЭтоАдминистратор();
КонецПроцедуры

Процедура Тест_Должен_Вернуть_ПолучитьСписокОбъектов() Экспорт
	Сообщить("Тест пустышка!");
	// ТипДанных = Неопределено;
	// ПостОбработка = Неопределено;
	// Результат = ОбъектТестирования.ПолучитьСписокОбъектов(ТипДанных, ПостОбработка);
КонецПроцедуры
